
[
    {
        "title": "React, Redux, and Redux-Saga",
        "image": "https://sm.pcmag.com/t/pcmag_au/news/a/amd-uses-z/amd-uses-zen-4c-cpu-cores-to-bolster-entry-level-laptop-chip_f9vy.3840.jpg",
        "articleText": "A simple React app that uses Redux and Redux-Saga to fetch data from an API.",
        "articleAuthor": "Kevin Durant"
    },
    {
        "title": "React, the best front-end framework",
        "image": "https://sm.pcmag.com/t/pcmag_au/news/e/early-blac/early-black-friday-dell-deals-a-sneak-peek-of-savings-on-lap_kf2q.3840.png",
        "articleText": "The question of whether React is the best front-end framework is subjective and depends on various factors, including the specific needs and goals of your project, your team's expertise, and your personal preferences. React is certainly a popular and widely used front-end library, but it's essential to consider other options and their respective strengths before deciding which one is best for your use case.",
        "articleAuthor": "Lebron James"
    },
    {
        "title": "What is Data Analytics?",
        "image": "https://sm.pcmag.com/t/pcmag_au/photo/default/vpn-1_p6yj.3840.jpg",
        "articleText": "Data analytics is the science of analyzing raw data in order to make conclusions about that information. Many of the techniques and processes of data analytics have been automated into mechanical processes and algorithms that work over raw data for human consumption. Data analytics techniques can reveal trends and metrics that would otherwise be lost in the mass of information. This information can then be used to optimize processes to increase the overall efficiency of a business or system.",
        "articleAuthor": "Paul George"
    },
    {
        "title": "Cybersecurity",
        "image": "https://sm.pcmag.com/t/pcmag_au/photo/default/children-computer_6tt2.3840.jpg",
        "articleText": "Cybersecurity is the practice of protecting systems, networks, and programs from digital attacks. These cyberattacks are usually aimed at accessing, changing, or destroying sensitive information; extorting money from users; or interrupting normal business processes.",
        "articleAuthor": "Devin Booker"
    }
]